export const aboutUsText = [
  "2013년, 서울대학교에서 이두희 대표를 필두로 시작된 '멋쟁이사자처럼 대학’은 현재 국내외 121개 대학, 4천여 명이 활동하는 국내 최대 규모의 IT 창업 동아리 입니다.\n\n",
  "2024년에 활동한 12기 숭실대 멋쟁이사자처럼은 뛰어난 성과를 바탕으로 ",
  { bold: "2024년 70개 동아리 중 1위 우수 동아리" },
  "로 선정되었으며, 대표적인 활동으로 한 학기간 PM, DE, FE, BE 파트별 집중 교육세션을 거치고 무박 2일 동안 121개 대학 약 1600명 규모의 인원이 참여하는 ",
  { bold: "중앙 해커톤과 3개월간의 겨울잠 장기 프로젝트를 진행합니다. \n\n" },
  "교육세션을 통해 성장한 파트별 역량을 바탕으로 협업을 통한 혁신적인 서비스를 창출하는 경험을 할 수 있으며 일년 간 다양한 활동을 통해 성장할 수 있습니다.\n\n",
  "숭실대 멋쟁이사자처럼은 ",
  {
    bold: "열심히 공부하고 재밌게 노는 분위기"
  },
  "를 지향합니다. 친바, MT, 회식 등 다양한 활동을 통해 회원들 간의 유대감을 강화하고 팀워크를 다지며, 서로의 작업을 이해하고 지식을 공유하는 소통의 장을 만들어가고 있습니다. \n\n",
  "이를 통해 멋쟁이사자처럼은 ",
  { bold: "단순한 IT 동아리를 넘어 창의적이고 협력적인 커뮤니티" },
  "로 자리 잡았습니다."
];

export const aboutUsShortText = [
  "2013년, 서울대학교에서 이두희 대표를 필두로 시작된 '멋쟁이사자처럼 대학’은 현재 국내외 121개 대학, 4천여 명이 활동하는 국내 최대 규모의 IT 창업 동아리 입니다. \n\n",
  "2024년에 활동한 12기 숭실대 멋쟁이사자처럼은 뛰어난 성과를 바탕으로",
  { bold: "2024년 70개 동아리 중 1위 우수 동아리로 선정" },
  "되었으며,  단순한 IT 동아리를 넘어 창의적이고 협력적인 커뮤니티로 자리 잡았습니다."
];
