export const commentsData: Record<
  "pm" | "de" | "fe" | "be",
  { name: string; batch: string; text: string }[]
> = {
  pm: [
    {
      name: "유승빈",
      batch: "12기",
      text: "함께한 멤버들이 모두 열정적인 사람들이었기에 PM으로서 팀을 이끄는 책임감을 더욱 깊이 배울 수 있었습니다. 열정적인 팀원들 사이에서 방향을 잡아가는 과정, 내가 모르는 부분을 스스로 학습해야 되는 것은 쉽지 않았지만 그만큼 성장할 수 있는 기회가 되었습니다. 멋쟁이 사자처럼 덕분에 1년을 알차게 보낸 것 같습니다!"
    },
    {
      name: "고영명",
      batch: "12기",
      text: "저는 12기 기획파트로 다양한 프로젝트를 경험하면서 PM이라는 직무를 더 구체적으로 그려볼 수 있었습니다! 그리고 멋사에서 만난 모든 친구들이 정말 대단하고 멋있는 사람들이라 덕분에 배운점도 느낀점도 많았어요. 멋사는 분명 좋은 성장의 발판이 되어줄거라 생각합니다 😊"
    },
    {
      name: "박하은",
      batch: "12기",
      text: "숭멋사를 하면서 제 진로를 찾을 수 있었고 프로젝트 경험도 다양하게 쌓을 수 있었습니다! 아무래도 PM은 혼자 하기에는 한계가 있는데 숭멋사에서는 개발자들과 디자이너들이 함께 프로젝트를 해나갈 수 있다는 점이 가장 좋았던 것 같습니다!! 서비스 기획을 해보고 싶다면 꼭 추천드립니다!"
    },
    {
      name: "최지예",
      batch: "12기",
      text: "PM으로 성장할 수 있게 도와주신 어른사자들, 그리고 같이 함께한 아기사자들까지 모두 고맙습니다. 멋사가 있어서 올해 너무 행복했어요! 다들 수고 많으셨고 이만 안뇽🦁"
    },
    {
      name: "류다인",
      batch: "12기",
      text: "IT 서비스 기획자에 대한 막연한 기대를 안고 숭멋사에 지원했던 기억이 납니다. 훌륭한 팀원분들과 프로젝트를 진행하며 PM 역량은 물론 다양한 경험을 쌓을 수 있었어요! 모두가 열정과 노력으로 가득한 팀에서 함께할 수 있어 행운이었어요. 1년간 밀도있게 성장하고 싶다면, 자신있게 숭멋사를 추천합니다! ♥"
    },
    {
      name: "김상우",
      batch: "12기",
      text: "대학에 와서 처음 가입한 동아리를 어떻게 수료까지 잘 마무리해서 참 다행이다. 주변에 멋쟁이사자처럼 동아리를 잘 몰랐던 친구들이 나로 인해서 멋사를 알게 된 모습을 보니 그래도 나름 활동을 많이 했구나 하는 생각이 들었다. 멋쟁이사자처럼의 여러 프로젝트에서 한명의 구성원으로써 활동할 수 있었음에 감사하고 또 수상이라는 남을만한 결과까지 얻어내서 충분히 보람 있었던 12기 활동이었다."
    }
  ],
  de: [
    {
      name: "유태연",
      batch: "12기",
      text: "단순한 디자인 툴 사용을 넘어, 다양한 프로젝트를 통해 UX에 대한 깊은 고민과 실질적인 협업 능력을 키울 수 있었습니다. 특히 해커톤에서 다른 멋사 아기사자들과 함께 열정을 나누며 성장할 수 있어 더욱 뜻깊은 경험이었습니다!"
    },
    {
      name: "지하윤",
      batch: "12기",
      text: "열정 넘치는 아기사자들과 소통하고 성장하며 보낸 일년이라는 시간은 값진 경험이자 소중한 추억으로 남을 것 같습니다! 다양한 프로젝트를 경험하며 디자인 실력은 물론이고 협업하는 법에 대해 정말 많이 배운 것 같아요. 멋사와 함께할 수 있었음에 다시한 번 감사드립니다 :-)"
    },
    {
      name: "신유정",
      batch: "12기",
      text: "멋사에서 아기사자들과 함께하며 디자인 실력 뿐만 아니라 기획자, 개발자와 소통하며 협업하는 법도 많이 배웠고 함께 고민하고 성장하는 과정이 즐거웠습니다. 디자인 뿐만 아니라 사람들과 함께 하는 법도 배울 수 있었던 따뜻한 시간이었습니다 :)"
    },
    {
      name: "정서윤",
      batch: "12기",
      text: "멋사 활동을 하면서 임원진분들과 팀장님들 덕분에 다양한 디자인 툴과 프로젝트 진행방식에 대해 배우고 이를 아이디어톤과 해커톤, 그리고 겨울잠까지 적용해보며 활용할 수 있었다는 점에서 매우 좋았습니다. 또한 다양한 분야의 사람들과 하나의 목적을 가지고 노력해나가는 과정에서 저 또한 많이 배우며 성장할 수 있어 감사한 시간들이었습니다!"
    },
    {
      name: "박지효",
      batch: "12기",
      text: "멋사에서 1년간 활동을 하며 UX/UI 디자인을 기초부터 차근차근 배울 수 있었습니다. 함께 열정을 나누고 서로의 고민을 공감해 줄 수 있는 있는 12기 동기들이 생겨서 든든하고, 혼자서는 해볼 수 없는 경험들을 많이 했던 것 같습니다. 13기 아기사자들도 멋사에서 깊이있는 경험을 하셨으면 좋겠습니다!"
    },
    {
      name: "김하연",
      batch: "12기",
      text: "멋사에서 활동한 덕분에 1년을 알차게 보낼 수 있었습니다! 열정 넘치는 아기사자들과 함께 할 수 있다는 점이 특별했고, 그로 인해 저도 많은 자극을 받지 않았나 싶습니다."
    }
  ],
  fe: [
    {
      name: "최다인",
      batch: "9기",
      text: "IT업계 내 여러 회사와 단체에서 멋쟁이사자처럼 분들이 열심히 활약하고 계십니다. 아마 열정 넘치는 분들이 멋사에 많고, 취업 이후에도 계속 활동을 하시기 때문이라 생각합니다. 멋사에서의 네트워크가 현직 개발자로 활동하는데 있어서 큰 도움이 되었습니다."
    },
    {
      name: "박채연",
      batch: "12기",
      text: "1년을 돌이켜보니 멋사에 들어오고 다양한 도전들을 했었고 많은 것들을 얻어갈 수 있었습니다. 앞으로 더 성장하기 위한 발판을 만들어주고, 나아갈 방향을 정하는데 도움을 많이 받았습니다."
    },
    {
      name: "김건휘",
      batch: "12기",
      text: "열정 넘치는 다양한 분야의 파트원들과 모여서 하나의 프로덕트를 만들어낼 수 있는 소중한 경험이었습니다. 멋사 덕분에 소중한 사람들과 추억 많이 쌓아가요😊"
    },
    {
      name: "유민주",
      batch: "12기",
      text: "멋쟁이사자처럼 덕분에 제 대학생활에서 가장 기억에 남을 1년을 보낼 수 있었어요. 팀원 모두가 함께 쌓아올린, 애정하는 우리의 서비스가 완성되던 날의 기분은 앞으로도 잊지 못할 것 같네요. 후회없는/ 꽉찬/ 의미있는 2025년을 보내고 싶다면 지금 바로 13기 숭실대 멋사에 지원해주세요!"
    },
    {
      name: "이시온",
      batch: "12기",
      text: "멋사에서 만난 멋진 팀원들과 함께 도전하며 성장할 수 있었던 값진 시간이었습니다. 단순한 1년간의 활동이 아니라, 앞으로 나아갈 용기와 자신감을 얻은 소중한 경험이었습니다🦁🧡"
    },
    {
      name: "백승현",
      batch: "12기",
      text: "멋사에 들어온 것은 제 큰 결심이자 출발이었는데, 끝까지 열정으로 맺을 수 있어 행복했습니다. 1년간 제 어떤 인생의 지점을 비교해도 2024년, 멋사로 제일 큰 성장을 이뤘던 것 같아 잊지 못할 것 같습니다. 후회없이 불태운 만큼 소중한 경험으로 남았습니다. 멋사 최고 💛"
    },
    {
      name: "공윤호",
      batch: "12기",
      text: "숭멋사는 제 대학생활의 전환점이었습니다. 열정있는 사자들과 같이 하다보니 개발자로서 많이 성장할 수 있었습니다. 숭멋사를 고민 중이라면 전 완전 찬성이에요!!"
    }
  ],
  be: [
    {
      name: "송은주",
      batch: "9기, 10기",
      text: "아무것도 모르는 감자 학부생이었지만 멋사를 통해 많은 변화를 이룰 수 있었습니다. 다양한 직군의 사람들과 함께 기획부터 개발까지 하나의 서비스를 만들어가는 A TO Z 를 경험할 수 있었습니다. 또한 숭실대 멋사 내부 행사 뿐만 아니라 중앙 멋사의 다양한 프로그램을 통해 많은 네트워킹 기회도 있어서 멋진 사람들과 함께 개발자로서의 성장을 이루고 싶으신 분들에게 최적의 환경이라고 생각합니다. 멋사는 제 대학생활의 터닝포인트라고 자랑스럽게 말할 수 있을 거 같아요. 그만큼 저에게는 소중한 경험으로 남아있습니다. 다함께 성장하고 후회없이 도전할 수 있는 환경인 숭멋사는 최고의 선택일거라 확신합니다 !!"
    },
    {
      name: "정예림",
      batch: "9기, 10기",
      text: "멋사는 단순한 동아리가 아니라, 함께 배우고 도전하며 성장하는 소중한 커뮤니티였습니다. 돌아보면 지난 2년 동안 제 대학생활의 전부였다고 해도 과언이 아니네요. 부족한 실력으로 시작했지만, 다양한 프로젝트를 경험하며 짧은 시간 동안 정말 많은 것을 배우고 성장할 수 있었습니다. 멋사가 없었다면 어떻게 시간을 보냈을지 상상이 가지 않아요. 덕분에 '열심히 했다'라고 자신있게 말할 수 있는 한 해를 보낼 수 있었습니다. 멋사는 여러 가지 행사가 있는 만큼 성장하고 도전할 기회도 많고, 무엇보다 좋은 사람들과 함께할 수 있습니다. 기획부터 개발까지 함께하며 힘든 순간도 기쁜 순간도 나눴던 멋사에서의 경험은 오래도록 기억에 남을 것 같습니다."
    },
    {
      name: "유승한",
      batch: "11기, 12기",
      text: "숭실대 멋쟁이사자처럼 11기에서 백엔드 개발자로, 12기에서는 대표로 활동하며 정말 행복한 학교 생활을 보냈습니다. 처음으로 프로덕트를 만들어 사용자와 소통했던 순간, 2000여 명과 함께 밤새 개발에 몰두했던 기억, 그리고 교육 봉사로 떠난 정선의 저녁 하늘에 떠 있던 수많은 별들까지—이 모든 순간이 그 자체로도 아름다웠지만, 멋사 친구들과 함께였기에 더욱 특별하고 소중한 추억이 되었습니다. 꿈 많고 열정 가득한 사람들이 모여 멋진 경험과 아름다운 추억을 쌓아가는 곳, 그것이 바로 숭실대 멋쟁이사자처럼입니다. 여러분도 13기로서 많은 추억과 경험 쌓아가시길 바랍니다."
    },
    {
      name: "박수영",
      batch: "11기, 12기",
      text: "작년 12기는 운영진인 저로서도 놀랄만큼 1년 동안 폭발적인 성장을 이루어낸 아기사자들이 많았습니다. 열정적인 친구들이 모여있어서 서로 도와주고 격려하며 빠르게 실력을 올릴 수 있는 풀이 존재하는 게 컸던 것 같습니다. 13기에서 많은 성장을 이뤄가길 바랍니다."
    },
    {
      name: "이상은",
      batch: "12기",
      text: "세션을 통해 기초 지식을 쌓고 실제 활용까지 경험할 수 있어 매우 유익했습니다! 특히 기획, 디자인, 개발 파트의 역할이 구분된 체계적인 프로젝트를 경험할 수 있어 큰 도움이 되었습니다!"
    },
    {
      name: "김선정",
      batch: "12기",
      text: "세션, 스터디 등을 통해 백엔드 지식을 쌓고 직접 배포해보며 많은 경험을 쌓을 수 있었습니다! 열정 가득한 운영진분들, 아기사자들과 함께 학습하고 소통하며 많이 배웠고 성장할 수 있어 값진 1년이었습니다 🥰"
    },
    {
      name: "신민경",
      batch: "12기",
      text: "멋쟁이사자처럼은 끝없는 도전을 펼칠 수 있는 곳이었습니다. 상상하던 것을 실현하고, 다양한 경험을 통해 성장할 수 있었습니다. 멋사는 최고의 선택입니다 💛"
    },
    {
      name: "전형준",
      batch: "12기",
      text: "좋은 환경을 만들어주는 운영진분들 덕분에 파트원, 팀원들과 적극적인 분위기에서 세션과 프로젝트들을 진행할 수 있었습니다. 한 학기가 아닌 1년간 진행되어 아이디어톤, 해커톤, 장기프로젝트까지 다양한 활동을 할 수 있다는 점도 정말 좋은 경험이었습니다!"
    },
    {
      name: "신지환",
      batch: "12기",
      text: "운 좋게 정말 좋은 동아리, 뛰어난 운영진과 동료분들 덕분에 크게 성장할 수 있었던 좋은 시간이었습니다. 멋사에서의 한 순간 순간이 훗날 대학 시절을 기억할 때 가장 큰 페이지를 차지할 것 같습니다. 함께했던 12기분들 너무 감사했고 우리 13기 여러분들도 파이팅입니다!"
    },
    {
      name: "정연재",
      batch: "12기",
      text: "다른 직군과 협업할 수 있어 서버 개발에만 집중할 수 있습니다. 다뤄보고 싶었던 기술을 실제 프로젝트에 적용해볼 기회가 있고, 애착이 생기는 좋은 결과물을 가지고 갈 수 있습니다!"
    }
  ]
};
