export const roleContents: Record<"pm" | "de" | "fe" | "be", string> = {
  pm: `Team Leader로서 프로젝트를 리드하며 서비스 기획자와 PM으로 성장하기 위한 역량을 키울 수 있습니다.
PM은 프로젝트의 전반적인 일정 관리를 담당하여 원활한 진행과 완료를 보장합니다. 
초기에는 요구 사항 수집과 분석을 통해 프로젝트의 방향과 목표를 설정하고, 이를 팀원들과 공유하여 프로젝트의 길잡이 역할을 수행합니다.
와이어프레임 및 플로우차트 등을 작성하여 프로젝트의 구조와 흐름을 시각화하고, 팀원들과 함께 검토하며 최적화하는 역할도 맡습니다.`,
  de: `디자인 툴을 익히고 다양한 웹 디자인 이론과 용어들을 배우며 협업에 도움이 되는 스킬을 키울 수 있습니다. 
프로젝트 기획 내용에 따라 서비스 로고, 일러스트, 아이콘, 사용자 인터페이스 등을 디자인하게 됩니다. 레이아웃을 설계하고 디자인 요소들의 상호작용과 일관성을 고려하여 사용자들에게 매력적이고 합리적인 환경을 제공합니다.
또한 기획 및 개발 파트와 긴밀한 협업으로 피드백을 주고 받으며 프로젝트 디자인 측면에서 품질을 향상시키려 노력합니다.`,
  fe: `프론트엔드 파트는 사용자가 직접 상호작용하는 웹 애플리케이션의 인터페이스를 개발합니다. UX/UI 디자인을 중점으로 시각적 요소와 상호작용을 설계하고 구현합니다. 
 HTML, CSS, JavaScript 등을 활용해 직관적이고 매력적인 UI를 제공합니다.
최신 프레임워크와 라이브러리로 반응형·동적 웹사이트를 개발하며, 접근성과 성능 최적화에 집중합니다. 백엔드와 협력해 API를 통해 데이터를 주고받고, 사용자 요구사항을 반영한 기능을 구현합니다.
웹 표준과 접근성 가이드라인을 준수해 모든 사용자가 원활히 이용할 수 있도록 합니다.`,
  be: `백엔드 파트는 API 개발, 배포, 운영을 통해 원활한 서비스를 제공합니다.
서버와 데이터베이스를 설계·관리하며, 서비스 요구사항을 반영해 웹 애플리케이션을 구현합니다. 클라우드 환경에서 서버와 DB를 구축·운영하며, 성능과 안정성을 고려합니다.
배포 및 유지보수를 담당하며, 기능과 성능 개선을 지속적으로 진행합니다.
또한, 프론트엔드·PM과 지속적으로 소통하며 원활한 협업을 통해 완성도 있는 서비스를 개발해나갑니다. `
};
