export const roleContents: Record<"pm" | "de" | "fe" | "be", string> = {
  pm: `Team Leader로서 프로젝트를 리드하며 서비스 기획자와 PM으로 성장하기 위한 역량을 키울 수 있습니다.
PM은 프로젝트의 전반적인 일정 관리를 담당하여 원활한 진행과 완료를 보장합니다. 
초기에는 요구 사항 수집과 분석을 통해 프로젝트의 방향과 목표를 설정하고, 이를 팀원들과 공유하여 프로젝트의 길잡이 역할을 수행합니다.
와이어프레임 및 플로우차트 등을 작성하여 프로젝트의 구조와 흐름을 시각화하고, 팀원들과 함께 검토하며 최적화하는 역할도 맡습니다.`,
  de: `디자인 툴을 익히고 다양한 웹 디자인 이론과 용어들을 배우며 다른 파트와의 협업을 위한 커뮤니케이션 스킬을 키울 수 있습니다.
프로젝트 기획 내용에 따라 UX/UI 및 콘텐츠 디자인을 담당합니다. 레이아웃을 설계하고 디자인 요소들의 상호작용과 일관성을 고려한 디자인시스템 구축과 프로토타입을 제작합니다.
문제 정의와 솔루션 도출 과정을 통해 사용자들에게 매력적이고 합리적인 환경을 제공하고, 기획 및 개발 파트와의 협업을 통해 사용자에게 가치를 전달하는 서비스를 함께 만들어갑니다.`,
  fe: `프론트엔드 파트는 사용자와 직접 맞닿는 웹 애플리케이션의 인터페이스를 개발합니다. 
UX/UI 디자인을 중점으로 시각적 요소와 상호작용을 설계하고 구현하며, HTML, CSS, JavaScript 등을 활용해 직관적이고 매력적인 UI를 제공합니다. 최신 프레임워크와 라이브러리를 활용해 반응형·동적 웹사이트를 개발하고, 접근성과 성능 최적화에 집중합니다.
JavaScript와 ES6+ 문법을 익히고, DOM과 이벤트를 활용한 동적 UI를 구현합니다. 또한, React를 통해 컴포넌트 기반 개발과 상태 관리를 배우며, API 통신과 비동기 처리로 백엔드와 연동하는 방법을 익힙니다.`,
  be: `백엔드 파트는 API 개발, 배포, 운영을 통해 원활한 서비스를 제공합니다.
  서비스 요구사항을 반영하여 서버와 데이터베이스를 설계·관리하고, 안정적인 웹 애플리케이션을 구현합니다. 클라우드 환경에서 서버와 DB를 구축·운영하며, 성능과 안정성을 고려한 최적화를 진행합니다.
또한, 지속적인 기능 개선과 유지보수를 통해 서비스 품질을 높이고, 최신 기술과 아키텍처를 도입하여 보안과 효율성을 강화합니다. 이를 통해 코드의 유지보수성을 높이고, 확장성을 고려한 아키텍처 설계를 통해 변화하는 비즈니스 환경에 유연하게 대응할 수 있습니다.`
};
